# -*- coding: utf-8 -*-

# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, что бы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечесленные.
# Порядок чисел нужно сохранить.

# Пример для чисел "1 2 3" и "9"
result = (1 + 2) * 3
result = ((1 * 2 + 3) + (4 * 5))  # TODO Обратите внимание, у вас в строке выше уже использована была
# TODO переменная result, когда мы используем её повторно - она перезаписывается и первый результат пропаадет
# TODO так лучше не поступать
print(result)

#  Получилось больше коммитов чем планировал, еще эксперементировал с удалением и изменением коммита.
#  Вопрос для ясности, получается коммитить надо когда все задания выполнил? Или можно по одному?
# Можно по одному
