#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['mother', 'father', 'sister', 'brother', 'grandfather', 'grandmother']


# список списков приблизителного роста членов вашей семьи
my_family_height = [['mother', 160],['father', 155],['sister', 165],['brother', 180],['grandfather', 170],['grandmother', 150]]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print('father')



# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см