#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'торт': [
        {'shop': 'ашан', 'price': 99.99},
        {'shop': 'магнит', 'price': 89.99}
    ],
    'шоколад': [
        {'shop': 'ашан', 'price': 49.99},
        {'shop': 'магнит', 'price': 39.99}
    ],
    'мармелад' : [
        {'shop': 'ашан', 'price': 79.99},
        {'shop': 'магнит', 'price': 69.99}
    ],
    'чак-чак' : [
        {'shop': 'ашан', 'price': 29.99},
        {'shop': 'магнит', 'price': 19.99}
    ]
}
print(sweets)
#Todo Вроде правильно понял, или надо было еще какой то код прописать?
